{"pages":[{"url":"contact","text":"Dr. Colin McLear Office: 1003 Oldfather Hall Office Hours: Email: mclear@unl.edu Email is the best way to reach me. I answer emails on weekdays, usually within 24 hrs. Students, please check your syllabus or the assignments online before emailing your question. If it is covered in the syllabus, I likely won't respond. Please remember to include an informative subject line that summarizes the content of your email (e.g. \"Question about Assignment 3 for PHIL101 ″ instead of \"Question\").","tags":"pages","title":"Contact"},{"url":"phil971.colinmclear.net","text":"This is the homepage for PHIL 971 — Seminar on topics in Kant's philosophy. The fall 2017 course will examine views concerning introspection and self-knowledge as they appear in the work of Kant and the early German Idealists, particularly Fichte and Schelling. We will also look at how these views have been developed and modified in contemporary philosophy. Questions of interest include: What is self-knowledge? Is self-knowledge special? (e.g. is it especially epistemically secure?) How is self-knowledge gained? (e.g via sensory means?) Does self-knowledge require consciousness? You can find the syllabus for the course here: HTML | PDF","tags":"pages","title":"Welcome!"},{"url":"resources","text":"Philosophy Links Some links for research, and for writing good philosophical prose. Stanford Encyclopedia of Philosophy Internet Encyclopedia of Philosophy PhilPapers Philosophical Terms & Methods Jim Pryor's guides to reading and writing philosophy Purdue Online Writing Lab A Guide to Philosophical Writing Academic Technology & Tools Links to tools for research and writing Markdown : Plaintext markup for easy writing Pandoc : File conversion Emacs : A superb (and free) text editor and writing/research platform BibDesk : Reference manager Skim : PDF reader & annotator Git : Version control Github : Online storage and collaboration Kieran Healy's writing resources page Profhacker : Blog on teaching & technology The Programming Historian : Tutorials for aspiring digital humanists","tags":"pages","title":"Resources"},{"url":"schedule","text":"Schedule TBA !","tags":"pages","title":"Schedule"},{"url":"week1.html","text":"This week we look at the some of the background to the positions Kant articulates concerning self-consciousness and self-knowledge. Readings TBA .","tags":"readings","title":"Week 1 - The Rationalist Background"}]}