{"pages":[{"url":"http://phil232.colinmclear.net/contact","text":"Dr. Colin McLear Office: 1003 Oldfather Hall Office Hours: Email: <!-- h='&#x75;&#110;&#108;&#46;&#x65;&#100;&#x75;';a='&#64;';n='&#x6d;&#x63;&#108;&#x65;&#x61;&#114;';e=n+a+h; document.write('<a h'+'ref'+'=\"ma'+'ilto'+':'+e+'\" clas'+'s=\"em' + 'ail\">'+e+'<\\/'+'a'+'>'); // --> mclear at unl dot edu Email is the best way to reach me. I answer emails on weekdays, usually within 24 hrs. Students, please check your syllabus before emailing your question. If it is covered in the syllabus, I likely won't respond. If you would like a response, please adhere to these basic email etiquette guidelines: Remember to include your full name and course/section. Use a professional email address, such as your UNL email account, to send email, instead of an anonymous internet account. Include an informative subject line that summarizes the content of your email (e.g. \"Question about Assignment 3 for PHIL101 ″ instead of \"Question\"). Begin your email with an appropriate greeting (Dear/Hi/Hello [professor's name]). Keep the body of your email brief and to the point. If it's longer than a paragraph, consider arranging a meeting during office hours to discuss your issue instead. Are you emailing with a question a classmate could answer (about material missed when absent, for example)? If so, ask that classmate before contacting your professor. It's more efficient for everyone. Do not send personal/confidential information in an email; email is not secure. Keep your tone professional. Write in complete sentences and avoid text-speak. Note: If your email looks like this: \"hi prof r we doing anything important 2day? kthxbai!\" you are unlikely to receive a reply. End your email with a closing (Best/Thank you/Sincerely/etc.) and your first and last name. Remember to leave time to receive a response. Do not expect a reply over the weekend or at 3 am, for example. Learning to communicate professionally is a critical skill that will help you in your future job searches and careers. Now is a good time to start practicing!","tags":"pages","title":"Contact"},{"url":"http://phil232.colinmclear.net/phil232.colinmclear.net","text":"This is the homepage for PHIL 232 — History of Early Modern Philosophy This course offers an introductory survey of some of the key figures in early modern (17th—18th century) European philosophy. These may include: Descartes, Locke, Leibniz, Newton, and Hume. Our main focus will be on the enormously influential theories of René Descartes, specifically his theories of mind and nature, as well as subsequent reactions, criticisms, and (partial) defenses of his views in the writings of other prominent philosophers. Major themes include the nature of mind and matter, the structure of scientific explanation, causation and necessity, free will, and the existence and nature of God. If you'd like to take a look at the syllabus you can find it here: HTML | PDF","tags":"pages","title":"Welcome!"},{"url":"http://phil232.colinmclear.net/resources","text":"Philosophy Links Some links for research, and for writing good philosophical prose. Stanford Encyclopedia of Philosophy Internet Encyclopedia of Philosophy PhilPapers Philosophical Terms & Methods Jim Pryor's guides to reading and writing philosophy Purdue Online Writing Lab A Guide to Philosophical Writing Academic Technology & Tools Links to tools for research and writing Markdown : Plaintext markup for easy writing Pandoc : File conversion Emacs : A superb (and free) text editor and writing/research platform BibDesk : Reference manager Skim : PDF reader & annotator Git : Version control Github : Online storage and collaboration Kieran Healy's writing resources page Profhacker : Blog on teaching & technology The Programming Historian : Tutorials for aspiring digital humanists","tags":"pages","title":"Resources"},{"url":"http://phil232.colinmclear.net/class-1.html","text":"Class overview. 1 References Smit, Houston. 2000. \"Kant on Marks and the Immediacy of Intuition.\" The Philosophical Review 109 (2): 235–66. Hello! ↩","tags":"assignments","title":"Class 1"},{"url":"http://phil232.colinmclear.net/a-test.html","text":"This is a test.","tags":"assignments","title":"A test"}]}