{"pages":[{"url":"contact","text":"Dr. Colin McLear Office: 1003 Oldfather Hall Office Hours: T/R 12:30-1:30 Email: mclear@unl.edu Email is the best way to reach me. I answer emails on weekdays, usually within 24 hrs.","tags":"pages","title":"Contact"},{"url":"phil971.colinmclear.net","text":"This is the homepage for PHIL 971 — Seminar on topics in Kant's philosophy. The fall 2017 course will examine views concerning introspection and self-knowledge as they appear in the work of Kant and the early German Idealists, particularly Fichte and Schelling. We will also look at how these views have been developed and modified in contemporary philosophy. Questions of interest include: What is self-knowledge? Is self-knowledge special? (e.g. is it especially epistemically secure?) How is self-knowledge gained? (e.g via sensory means?) Does self-knowledge require consciousness? You can find the syllabus for the course here: HTML | PDF","tags":"pages","title":"Welcome!"},{"url":"resources","text":"Course Mechanics Signing up for a Disqus account Reading & Writing Philosophy Jim Pryor's guides to reading and writing philosophy Purdue Online Writing Lab A Guide to Philosophical Writing Writing a Thesis Statement Philosophy Paper Structure Philosophical Concepts & Background Critical Thinking Philosophical Terms & Methods Internet Encyclopedia of Philosophy Stanford Encyclopedia of Philosophy","tags":"pages","title":"Resources"},{"url":"schedule","text":"A tentative schedule is below. For final word on the current week's assignment please look under the \" Readings \" tab. Week Date Topic 1 8/22 Cartesianism & self-knowledge 2 8/29 Locke vs. Leibniz 3 9/5 Criticism of inner sense theories 4 9/12 Kant on introspection: inner sense or self-acquaintance? 5 9/19 Kant on \"Pure Apperception\" 6 9/26 Pure apperception, attention, reflection, & ownership 7 10/3 Reflection & regress 8 10/10 No Class (reschedule to 10/12 at 1:30) 10/12 Is self-knowledge fundamental? (I: Boyle & Kitcher) 9 10/17 Fall Break ( No Class ) 10 10/24 No Class 11 10/31 Is self-knowledge fundamental? ( II : Burge) 12 11/7 Reinhold on Self-Consciousness & Fichte's Anesidemus Review 13 11/14 Schelling on the ‘I' 14 11/21 Fichte, First Introduction 15 11/28 Fichte, Second Introduction 16 12/5 Catch-up","tags":"pages","title":"Schedule"},{"url":"week12.html","text":"This week we begin our discussion of German Idealism. We'll look at Karl Leonhard Reinhold ‘s criticism of the incompleteness of Kant's critical philosophy and his (Reinhold's) conception of what is needed to complete it. We'll also look at criticisms of Reinhold's \"principle of consciousness\" by Schulze and Fichte. Readings Reinhold, The Foundation of Philosophical Knowledge (from p. 61 onward) Schulze, Aenesidemus (excerpt, pp. 105-12) Fichte, Review of Aenesidemus","tags":"readings","title":"Week 12 - Reinhold & Critics"},{"url":"week10.html","text":"This week we discuss Tyler Burge's argument concerning our entitlement to self-knowledge. We'll also look at one recent criticism of that argument by Brie Gertler. The handout for this week is here . Readings Burge, Our Entitlement to Self-Knowledge (optional) Burge, Perceptual Entitlement (just §I) Gertler, Self-Knowledge & Rational Agency","tags":"readings","title":"Week 11 - The Fundamentality of Self-Knowledge ( II )"},{"url":"week8.html","text":"This week we look at Matt Boyle's view, influenced by a reading of Kant (via interpretation of Moran), that there are two kinds of self-knowledge, and that one has priority over the other. We'll also look at Patricia Kitcher's discussion of Boyle's view (see pp. 263-5) and how it fits into her alternative conception of Kant's view of self-consciousness. The handout for this week is here . Readings Boyle, \" Two Kinds of Self-Knowledge \" Kitcher, \" Kant Our Contemporary \" (§3 \"Must Rational Cognition Involve Self-consciousness?\") For an overview of Kitcher's position see her précis","tags":"readings","title":"Week 8 - The Fundamentality of Self-Knowledge"},{"url":"week7.html","text":"We've been looking at Kant's views on self-consciousness and the pressures his views were under to allow for some kind of positive content to self-consciousness that isn't to be characterized in terms of sensory content. This week we'll continue with this issue and examine a central problem for Kant's critical philosophy—-viz. how Kant explains our knowledge of the basic synthetic a priori claims about the mind necessary for the critical philosophy. We'll look at the role reflective self-consciousness plays in providing such an explanation. The handout for this week is here . Readings Marshall, \" Does Kant Demand Explanations for All Synthetic A Priori Claims? \"","tags":"readings","title":"Week 7 - Self-Consciousness & Regress"},{"url":"week6.html","text":"We'll continue discussing Kant's view of self-consciousness, and particularly the relationship between his notions of \"reflection\" and \"pure apperception\". The handout for this week is here . Readings Look over last week's readings Excerpts from the Anthropology Part I, §§1-7, §24","tags":"readings","title":"Week 6 - Reflection & Pure Apperception"},{"url":"week5.html","text":"We'll discuss Kant's pre-critical views concerning self-consciousness as a form of inner inner intuition in the 1760s-70s and his transition to a bifurcated view of self-consciousness in the critical period. The handout for this week is here . Readings See last week's readings for Kant's pre-critical views B-Deduction (focus especially on §§16-18 and §§24-25) First Paralogism (A-edition)","tags":"readings","title":"Week 5 - Inner Sense & Pure Apperception"},{"url":"week4.html","text":"This week we finish our discussion of Shoemaker's criticisms of inner sense views. We'll then start looking at the evolution of Kant's views concerning these issues. The handout for this week is here . Readings Shoemaker, Self-Knowledge and \"Inner Sense\", Lecture 2 (optional) McLear, Kant: Philosophy of Mind Kant, excerpts from the pre-critical writings Notes & Fragments (excerpts) Pölitz Metaphysics Lecture Notes, excerpts from Cosmology and Psychology On the form and principles of the sensible and the intelligible world , §§3-12 Collins Anthropology Lecture Notes (excerpt)","tags":"readings","title":"Week 4 - Inner Sense & the Pre-Critical Kant"},{"url":"week3.html","text":"This week we discuss some prominent contemporary objections to an inner sense view. These include the doubts about inner sense being a genuine sense , and objections concerning what self-knowledge would end up looking like on an inner sense account. The handout for this week is here . Readings Geach, The notion of ‘inner sense' Shoemaker, Self-Knowledge and \"Inner Sense\", Lecture 1 and Lecture 2","tags":"readings","title":"Week 3 - Objections to Inner Sense"},{"url":"week2.html","text":"This we look at Locke's view concerning ‘inner sense' or ‘reflection' as a source of our ideas. We'll connect it to last week's discussion of Cartesian reflection and the notion of an \"intuition of the mind\", as well as Leibniz's appropriation of aspects of both Descartes's and Locke's views. The handouts for this week are here (on the Cogito ) and here (on Locke). Readings Locke on inner sense Leibniz on inner sense New Essays, Preface (excerpt) New Essays, Bk. II , Ch. i Weinberg, \" Consciousness in Locke's Philosophical Psychology \" (Recommended) Weinberg, \" Consciousness in Locke's Theory of Knowledge \" (Part I)","tags":"readings","title":"Week 2 - Locke & Leibniz on Reflection"},{"url":"week1.html","text":"This week we look at some of the ways in which Descartes sets out self-knowledge as crucial to philosophy. We'll also set out a basic framework for discussion of the various issues concerning self-consciousness and self-knowledge as they will appear throughout the course. The handout for this week is here . Readings Descartes, Meditations 1-3 (especially Med 2 and first half of Med 3) Zimmerman, \"Self-knowledge\" (focus in particular on §§1-4) (Recommended) Broughton, Descartes on Self-Knowledge (Recommended) Gertler, SEP entry on self-knowledge","tags":"readings","title":"Week 1 - Cartesianism & Self-Knowledge"}]}